[
  {
    "doc_id": 1,
    "section_title": "Page 1, Line 1",
    "location": "Page 1, Line 1",
    "theme": "Figures/Tables",
    "chunk_index": 0,
    "text": "Here is the extracted data in a structured format:\n\n**KEY POINTS**\n\n* The man with the scarred face has been to Aepyornis Island 25-27 years ago.\n* He used to collect orchids and other plants for Dawson's.\n* He knows someone named Butcher.\n\n**NUMERICAL VALUES**\n\n* 25-27: Number of years ago that the man visited Aepyornis Island.\n* 2: Number of years he spent in the East Indies.\n* 7: Number of years he spent in Brazil.\n\n**KEY TAKEAWAYS**\n\n* None\n\n**TECHNICAL DETAILS**\n\n* None\n\n**IMPORTANT FACTS**\n\n* The man with the scarred face is an experienced explorer who has been to various places, including Aepyornis Island, the East Indies, Brazil, and Madagascar.\n* He used to collect plants for Dawson's.\nTheme: Figures/Tables\nLocation: Page 1, Line 1",
    "original_chunk_id": 1,
    "keypoints_length": 703
  },
  {
    "doc_id": 2,
    "section_title": "Page 1, Line 16",
    "location": "Page 1, Line 16",
    "theme": "General Content",
    "chunk_index": 0,
    "text": "Here is the extracted content:\n\n**KEY POINTS**\n\n* The man with the scar sued someone for four years' salary.\n* He was cast away on a desert island and made a little fortune doing nothing.\n* He found Aepyornis bones, which are nearly 20 years old.\n* Dawson's failure to give notice led to the man's situation.\n\n**NUMERICAL VALUES**\n\n* Four years: duration of the man's salary dispute\n* Nearly 20 years ago: when the man found the Aepyornis bones\n* Three or four years ago: when the Aepyornis bones were first discovered\n* Ninety miles north: location of the swamp where the Aepyornis bones were found\n\n**KEY TAKEAWAYS**\n\n* The man's situation was a result of Dawson's failure to give notice.\n* The discovery of the Aepyornis bones is significant.\n\n**TECHNICAL DETAILS**\n\n* None extracted in this section.\n\n**IMPORTANT FACTS**\n\n* The Aepyornis is a prehistoric bird with a thigh-bone nearly a yard long.\n* Sindbad's roc is a legendary creature.\nTheme: General Content\nLocation: Page 1, Line 16",
    "original_chunk_id": 2,
    "keypoints_length": 942
  },
  {
    "doc_id": 2,
    "section_title": "Page 1, Line 16",
    "location": "Page 1, Line 16",
    "theme": "General Content",
    "chunk_index": 1,
    "text": "on.\n\n**IMPORTANT FACTS**\n\n* The Aepyornis is a prehistoric bird with a thigh-bone nearly a yard long.\n* Sindbad's roc is a legendary creature.\nTheme: General Content\nLocation: Page 1, Line 16",
    "original_chunk_id": 2,
    "keypoints_length": 942
  },
  {
    "doc_id": 3,
    "section_title": "Page 2, Line 9",
    "location": "Page 2, Line 9",
    "theme": "General Content",
    "chunk_index": 0,
    "text": "Here is the extracted content in a structured format:\n\n**KEY POINTS**\n\n* The location mentioned is Antananarivo, which can be reached by boats along the coast.\n* The speaker has visited the place and found something that keeps things from decaying, similar to creosote.\n* The area is on the east coast and features a swamp that goes circling round and cuts off a bit of land.\n* The swamp is mostly saltwater.\n* The speaker went to the area with two native chaps in a rum canoe to collect eggs.\n* They found bones at the same time as the eggs.\n* The speaker used iron rods to probe into the mud, but usually the egg gets smashed.\n* The eggs they collected were as fresh as if they had been newly laid.\n\n**NUMERICAL VALUES**\n\n* Four days: duration of their expedition\n* One and a half feet: length of some of the eggs found\n\n**KEY TAKEAWAYS**\n\n* The speaker's experience was unusual and unexpected, with the discovery of ancient bones and eggs.\n* The area has unique properties that allow things to rem",
    "original_chunk_id": 3,
    "keypoints_length": 1479
  },
  {
    "doc_id": 3,
    "section_title": "Page 2, Line 9",
    "location": "Page 2, Line 9",
    "theme": "General Content",
    "chunk_index": 1,
    "text": "ome of the eggs found\n\n**KEY TAKEAWAYS**\n\n* The speaker's experience was unusual and unexpected, with the discovery of ancient bones and eggs.\n* The area has unique properties that allow things to remain fresh for centuries.\n\n**TECHNICAL DETAILS**\n\n* Iron rods were used to probe into the mud\n* Rum canoes were used as transportation\n\n**IMPORTANT FACTS**\n\n* The speaker found Aepyornis eggs, which are extremely large (up to 1.5 feet long).\n* The eggs were as fresh as if they had been newly laid, despite being hundreds of years old.\n* The missionaries claim that the natives have legends about when the Aepyornises lived, but the speaker has not heard these stories themselves.\nTheme: General Content\nLocation: Page 2, Line 9",
    "original_chunk_id": 3,
    "keypoints_length": 1479
  },
  {
    "doc_id": 4,
    "section_title": "Page 2, Line 26",
    "location": "Page 2, Line 26",
    "theme": "General Content",
    "chunk_index": 0,
    "text": "Here is the extracted content:\n\n**KEY POINTS**\n\n* A centipede had bitten someone.\n* It took all day to dig into the slush and get eggs out unbroken.\n* The narrator was cross because they were covered in black mud.\n* The narrator's eggs were perfect, unlike those at the Natural History Museum in London.\n* Someone dropped three hours' work due to a centipede bite.\n* The narrator hit someone about it.\n\n**NUMERICAL VALUES**\n\n* Three: number of hours' work lost\n* Three: number of others (eggs) mentioned\n\n**KEY TAKEAWAYS**\n\n* Centipedes can cause trouble and lead to conflicts.\n* People can be upset when their work is disrupted.\n\n**TECHNICAL DETAILS**\n\n* Spirit-lamp used for boiling water\n* Pouch used to carry something\n\n**IMPORTANT FACTS**\n\n* The narrator's eggs were unbroken and perfect, unlike those at the Natural History Museum in London.\n* Someone was persuaded by a centipede bite to pick a quarrel.\nTheme: General Content\nLocation: Page 2, Line 26",
    "original_chunk_id": 4,
    "keypoints_length": 910
  },
  {
    "doc_id": 4,
    "section_title": "Page 2, Line 26",
    "location": "Page 2, Line 26",
    "theme": "General Content",
    "chunk_index": 1,
    "text": " those at the Natural History Museum in London.\n* Someone was persuaded by a centipede bite to pick a quarrel.\nTheme: General Content\nLocation: Page 2, Line 26",
    "original_chunk_id": 4,
    "keypoints_length": 910
  },
  {
    "doc_id": 5,
    "section_title": "Page 3, Line 10",
    "location": "Page 3, Line 10",
    "theme": "General Content",
    "chunk_index": 0,
    "text": "Here is the extracted content:\n\n**KEY POINTS**\n\n* The narrator is stranded on a black beach with three days' provisions and no drinking water.\n* A group of people (heathens) try to abandon him in a canoe, but he manages to shoot one of them with his revolver.\n* The narrator swims after the canoe and eventually catches up to it, finding the dead body of the man he shot.\n* The narrator drifts away on the sea, waiting for something to happen.\n\n**NUMERICAL VALUES**\n\n* 50 yards: distance from land where the narrator first sees the canoe\n* 20 yards: distance from land where the narrator is when he shoots at the canoe\n* 3 days: amount of provisions the narrator has\n\n**KEY TAKEAWAYS**\n\n* The narrator feels foolish and stranded after being abandoned by the group.\n* He eventually drifts away on the sea, waiting for something to happen.\n\n**TECHNICAL DETAILS**\n\n* The narrator uses a revolver with duck shot (not suitable for hunting) and later finds that he has no bullets.\n* He uses a clasp-knife a",
    "original_chunk_id": 5,
    "keypoints_length": 1448
  },
  {
    "doc_id": 5,
    "section_title": "Page 3, Line 10",
    "location": "Page 3, Line 10",
    "theme": "General Content",
    "chunk_index": 1,
    "text": "sea, waiting for something to happen.\n\n**TECHNICAL DETAILS**\n\n* The narrator uses a revolver with duck shot (not suitable for hunting) and later finds that he has no bullets.\n* He uses a clasp-knife and puts it in his mouth before swimming after the canoe.\n* The narrator describes the phosphorescence in the water as \"glowing things\" and notes that it makes him feel giddy.\n\n**IMPORTANT FACTS**\n\n* The narrator is stranded with limited provisions and no drinking water.\n* He manages to shoot one of the people trying to abandon him, but they still refuse to come back.\n* The narrator eventually finds the dead body of the man he shot in the canoe.\nTheme: General Content\nLocation: Page 3, Line 10",
    "original_chunk_id": 5,
    "keypoints_length": 1448
  },
  {
    "doc_id": 6,
    "section_title": "Page 4, Line 31",
    "location": "Page 4, Line 31",
    "theme": "General Content",
    "chunk_index": 0,
    "text": "Here is the extracted content in a structured format:\n\n**KEY POINTS**\n\n* \"I never read one through thoroughly before\" (statement about reading newspapers)\n* \"Every day was like the last\" (description of time spent at sea)\n* \"I didn’t see a sail after the first three days, and those I saw took no notice of me\" (observation about ships passing by)\n* \"About the sixth night a ship went by scarcely half a mile away from me, with all its lights ablaze and its ports open, looking like a big firefly\" (description of a passing ship)\n\n**NUMERICAL VALUES**\n\n* 10 days: duration of time spent at sea\n* 3 days: number of days before no more ships were seen\n* 6 inches: size of the circular patch on one side of the yoke\n\n**KEY TAKEAWAYS**\n\n* The narrator spends 10 days alone at sea, with little to do but read and observe.\n* Despite seeing some ships pass by, none take notice of him.\n\n**TECHNICAL DETAILS**\n\n* None found in this section.\n\n**IMPORTANT FACTS**\n\n* The narrator eats an Aepyornis egg, finding",
    "original_chunk_id": 6,
    "keypoints_length": 1063
  },
  {
    "doc_id": 6,
    "section_title": "Page 4, Line 31",
    "location": "Page 4, Line 31",
    "theme": "General Content",
    "chunk_index": 1,
    "text": "ead and observe.\n* Despite seeing some ships pass by, none take notice of him.\n\n**TECHNICAL DETAILS**\n\n* None found in this section.\n\n**IMPORTANT FACTS**\n\n* The narrator eats an Aepyornis egg, finding it \"good enough to eat\" with a flavor similar to a duck's egg.\nTheme: General Content\nLocation: Page 4, Line 31",
    "original_chunk_id": 6,
    "keypoints_length": 1063
  },
  {
    "doc_id": 7,
    "section_title": "Page 5, Line 8",
    "location": "Page 5, Line 8",
    "theme": "Technical Details",
    "chunk_index": 0,
    "text": "Here is the extracted data in a structured format:\n\n**Location**: Page 5, Line 8\n\n**Key Points**:\n\n* The narrator hatches an Aepyornis egg and names the chick \"Man Friday\".\n* Man Friday grows rapidly and becomes a friendly companion to the narrator.\n* The narrator and Man Friday live on the island for nearly two years, with the narrator decorating the island with designs worked in sea-urchins and fancy shells.\n* Man Friday begins to show signs of a nasty temper and starts to cock his comb at the narrator.\n* The narrator's fishing becomes unlucky, leading to tension between him and Man Friday.\n* Man Friday attacks the narrator, causing physical harm and emotional distress.\n\n**Numerical Values**:\n\n* Three hundred years: the length of time the Aepyornis egg had been submerged in mud before being found by the narrator.\n* Four miles: the diameter of the atoll where the narrator lands after hatching the egg.\n* Two years: the duration of the narrator's life on the island with Man Friday.\n\n**K",
    "original_chunk_id": 7,
    "keypoints_length": 1698
  },
  {
    "doc_id": 7,
    "section_title": "Page 5, Line 8",
    "location": "Page 5, Line 8",
    "theme": "Technical Details",
    "chunk_index": 1,
    "text": "ing found by the narrator.\n* Four miles: the diameter of the atoll where the narrator lands after hatching the egg.\n* Two years: the duration of the narrator's life on the island with Man Friday.\n\n**Key Takeaways**:\n\n* The narrator forms a strong bond with Man Friday, but this bond is eventually broken due to Man Friday's aggressive behavior.\n* The narrator experiences emotional distress and physical harm as a result of Man Friday's attack.\n\n**Technical Details**:\n\n* The narrator uses sea-urchins and fancy shells to decorate the island.\n* The narrator rigs up a storm-shelter using vestiges of his canoe.\n\n**Important Facts**:\n\n* The Aepyornis egg had been submerged in mud for three hundred years before being found by the narrator.\n* Man Friday grows rapidly, reaching a height of 14 feet at the bill.\n* The narrator's fishing becomes unlucky, leading to tension between him and Man Friday.\nTheme: Technical Details\nLocation: Page 5, Line 8",
    "original_chunk_id": 7,
    "keypoints_length": 1698
  },
  {
    "doc_id": 7,
    "section_title": "Page 5, Line 8",
    "location": "Page 5, Line 8",
    "theme": "Technical Details",
    "chunk_index": 2,
    "text": "the bill.\n* The narrator's fishing becomes unlucky, leading to tension between him and Man Friday.\nTheme: Technical Details\nLocation: Page 5, Line 8",
    "original_chunk_id": 7,
    "keypoints_length": 1698
  },
  {
    "doc_id": 8,
    "section_title": "Page 8, Line 19",
    "location": "Page 8, Line 19",
    "theme": "General Content",
    "chunk_index": 0,
    "text": "Here is the extracted content:\n\n**KEY POINTS**\n\n* The narrator had a terrible experience sleeping on a palm tree due to an extinct bird's presence.\n* The bird was moaning and snapping its beak at the narrator, causing shame and frustration.\n* The narrator tried to reason with the bird but it didn't work, leading to feelings of weariness and vexation.\n* The narrator eventually killed the bird using a South American dodge involving fishing lines, seaweed, and coral rocks.\n\n**NUMERICAL VALUES**\n\n* 12 yards: length of the string made from fishing lines and seaweed\n* Unspecified number: how long the narrator had to deal with the bird's presence before killing it\n\n**KEY TAKEAWAYS**\n\n* The narrator felt a strong sense of shame and frustration due to the bird's behavior.\n* The narrator eventually resorted to violence to resolve the situation.\n\n**TECHNICAL DETAILS**\n\n* South American dodge: an unspecified method used by the narrator to kill the bird\n* Fishing lines, seaweed, and coral rocks: ma",
    "original_chunk_id": 8,
    "keypoints_length": 1288
  },
  {
    "doc_id": 8,
    "section_title": "Page 8, Line 19",
    "location": "Page 8, Line 19",
    "theme": "General Content",
    "chunk_index": 1,
    "text": "resorted to violence to resolve the situation.\n\n**TECHNICAL DETAILS**\n\n* South American dodge: an unspecified method used by the narrator to kill the bird\n* Fishing lines, seaweed, and coral rocks: materials used to create a string for killing the bird\n\n**IMPORTANT FACTS**\n\n* The bird was extinct.\n* The narrator felt like a murderer while killing the bird.\n* The narrator missed the bird after it died and felt regretful about not having found a way to peacefully resolve the situation.\nTheme: General Content\nLocation: Page 8, Line 19",
    "original_chunk_id": 8,
    "keypoints_length": 1288
  },
  {
    "doc_id": 9,
    "section_title": "Page 9, Line 8",
    "location": "Page 9, Line 8",
    "theme": "General Content",
    "chunk_index": 0,
    "text": "Here is the extracted content:\n\n**KEY POINTS**\n\n* The narrator couldn't think of eating a human and instead put it in the lagoon for the little fishes to clean.\n* A chap cruising about in a yacht visited the atoll, which was on the verge of being abandoned by the narrator.\n* The narrator sold the bones to Winslow, who then sold them to old Havers.\n* Havers didn't understand that the bones were extra large and it wasn't until after his death that they attracted attention.\n\n**NUMERICAL VALUES**\n\n* None\n\n**KEY TAKEAWAYS**\n\n* The narrator was considering abandoning the atoll due to its desolation.\n* The bones of a human were sold multiple times before their significance was understood.\n\n**TECHNICAL DETAILS**\n\n* Aepyornis vastus is mentioned as the scientific name for the extra large bones.\n\n**IMPORTANT FACTS**\n\n* The narrator put a human body in the lagoon and didn't save its feathers.\n* The bones of the human were sold to multiple people before their significance was understood.\nTheme: Ge",
    "original_chunk_id": 9,
    "keypoints_length": 990
  },
  {
    "doc_id": 9,
    "section_title": "Page 9, Line 8",
    "location": "Page 9, Line 8",
    "theme": "General Content",
    "chunk_index": 1,
    "text": "IMPORTANT FACTS**\n\n* The narrator put a human body in the lagoon and didn't save its feathers.\n* The bones of the human were sold to multiple people before their significance was understood.\nTheme: General Content\nLocation: Page 9, Line 8",
    "original_chunk_id": 9,
    "keypoints_length": 990
  },
  {
    "doc_id": 10,
    "section_title": "Page 9, Line 18",
    "location": "Page 9, Line 18",
    "theme": "General Content",
    "chunk_index": 0,
    "text": "Here is the extracted content:\n\n**KEY POINTS**\n\n* When they found an Aepyornis with a thigh a yard long, they thought they had reached the top of the scale and called it Aepyornis maximus.\n* Then someone turned up another thigh-bone four feet six or more, and that was called Aepyornis titan.\n* Your vastus was found after old Havers died, in his collection, and then a vastissimus turned up.\n\n**NUMERICAL VALUES**\n\n* 1 yard: length of the thigh of an Aepyornis\n* 4 feet 6 or more: length of another thigh-bone\n\n**KEY TAKEAWAYS**\n\n* The discovery of larger Aepyornises led to the naming of new species.\n* The man with the scar is aware that further discoveries could lead to scientific controversy.\n\n**TECHNICAL DETAILS**\n\n* None extracted from this content section.\n\n**IMPORTANT FACTS**\n\n* The story mentions the death of old Havers, which led to the discovery of a vastus in his collection.\nTheme: General Content\nLocation: Page 9, Line 18",
    "original_chunk_id": 10,
    "keypoints_length": 892
  },
  {
    "doc_id": 10,
    "section_title": "Page 9, Line 18",
    "location": "Page 9, Line 18",
    "theme": "General Content",
    "chunk_index": 1,
    "text": " mentions the death of old Havers, which led to the discovery of a vastus in his collection.\nTheme: General Content\nLocation: Page 9, Line 18",
    "original_chunk_id": 10,
    "keypoints_length": 892
  }
]